-- Создание таблицы students
DROP TABLE IF EXISTS students;
CREATE TABLE students (
    student_id SERIAL PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER NOT NULL,
    department TEXT NOT NULL
);

-- Вставка начальных данных в таблицу students
INSERT INTO students (name, age, department) VALUES
('Алексей', 19, 'Физика'),
('Ольга', 20, 'Физика'),
('Иван', 21, 'Физика'),
('Елена', 22, 'Физика'),
('Дмитрий', 23, 'Физика'),
('Мария', 24, 'Физика'),
('Сергей', 18, 'Математика'),
('Анна', 19, 'Математика'),
('Петр', 20, 'Математика'),
('Наталья', 21, 'Математика'),
('Виктор', 22, 'Математика'),
('Юлия', 23, 'Математика'),
('Игорь', 24, 'Литература'),
('Татьяна', 25, 'Литература'),
('Андрей', 26, 'Литература'),
('Светлана', 27, 'Литература'),
('Владимир', 28, 'Литература'),
('Екатерина', 29, 'Литература');